#+BEGIN_COMMENT
.. title: Algos & Programming - Lecture 22 & 23
.. slug: algos-and-prog-22-23
.. date: 2019-01-07
.. tags: university, A&P 
.. category: 
.. link: 
.. description: 
.. type: text
.. has_math: true
#+END_COMMENT

This chapter spans two lectures so lecture 22 and 23 will be pooled into this single blog post.

* Linker and Libraries
In the last chapter where we built a game we split functionality into different modules which had their own source file. The linker was responsible for assembling the single modules together. We now want to take a more detailed look into the linker.

The following image shows where the linker is involved:

[[/knowledge-database/images/linker-overview.png ]]

Now let's look at the following code of a generic swap function:
#+BEGIN_SRC C
  #include  <stddef.h> // for size_t

  extern void* malloc(size_t);
  extern void free(void*);

  static void bytecopy(char *dest, char *src, size_t size) {
    while (size > 0) {
      ,*dest++ = *src++;
      size--;
    }
  }

  int swap(void *first, void *second, size_t size) {
    void *tmp = malloc(size);
    if (!tmp) return 0;

    bytecopy(tmp, first, size);
    bytecopy(first, second, size);
    bytecopy(second, tmp, size);

    free(tmp);

    return 1;
  }
#+END_SRC

The code above can be used with different types as the following program demonstrates.
#+BEGIN_SRC C
  #include <stdio.h>

  int swap(void* first, void* second, size_t size);

  char* str1 = "Hello";
  char* str2 = "World";

  int a, b;

  int main() {
    printf("1st string: %s, 2nd string: %s\n", str1, str2);
    swap(&str1, &str2, sizeof(str1));
    printf("1st string: %s, 2nd string: %s\n", str1, str2);

    a = 42;
    b = 23;
  
    printf("1st integer: %d, 2nd integer: %d\n", a, b);
    swap(&a, &b, sizeof(a));
    printf("1st integer: %d, 2nd integer: %d\n", a, b);

    return 0;
  }
#+END_SRC
Now to get one program file out of our two source code files (swap.c and smain.c) both need to be compiled/translated and then linked together:
#+BEGIN_SRC sh 
cc -std=c99 -Wall euclid.c swap.c smain.c -o sm
#+END_SRC

[[/knowledge-database/images/linking-process.png ]]

and then execute the program file
#+BEGIN_SRC sh
./sm
#+END_SRC
#+BEGIN_SRC C :results output print :exports results
  #include  <stddef.h> // for size_t
  #include <stdio.h>


  extern void* malloc(size_t);
  extern void free(void*);

  static void bytecopy(char *dest, char *src, size_t size) {
    while (size > 0) {
      ,*dest++ = *src++;
      size--;
    }
  }

  int swap(void *first, void *second, size_t size) {
    void *tmp = malloc(size);
    if (!tmp) return 0;

    bytecopy(tmp, first, size);
    bytecopy(first, second, size);
    bytecopy(second, tmp, size);

    free(tmp);

    return 1;
  }


  char* str1 = "Hello";
  char* str2 = "World";

  int a, b;

  int main() {
    printf("1st string: %s, 2nd string: %s\n", str1, str2);
    swap(&str1, &str2, sizeof(str1));
    printf("1st string: %s, 2nd string: %s\n", str1, str2);

    a = 42;
    b = 23;
  
    printf("1st integer: %d, 2nd integer: %d\n", a, b);
    swap(&a, &b, sizeof(a));
    printf("1st integer: %d, 2nd integer: %d\n", a, b);

    return 0;
  }
#+END_SRC

#+RESULTS:
: 1st string: Hello, 2nd string: World
: 1st string: World, 2nd string: Hello
: 1st integer: 42, 2nd integer: 23
: 1st integer: 23, 2nd integer: 42

So let's repeat why we use/need a linker:
- *modularity*
  - programs can be created as a collection of smaller source files instead of in one giant monolithic file
  - enables creation and distribution of commonly used functions/functionality in libraries (eg standard library, math library etc)
- *efficiency*
  - time: not all of the source code has to be compiled each time
  - space: libraries can act as a collection of different functions, but the "finished" program only contains the functions that it needs/uses

    
And what does the linker really do?

1. *Resolution (Auflösung) of symbols*
   - programs define and reference *symbols*, i.e. names of variables and functions:
     - =int swap() { ... }= defines symbol =swap=
     - =swap(&a, &b, sizeof(a))= references symbols =swap=, =a= and =b=
     - =int a;= defines symbol =a=
   - symbol definitions are stored in a *symbol table* by the compiler
     - the symbol table is an array of a special data structure (struct) which stores the name, type, size and location for every symbol
   - the linker connects (verknuepft) every symbol reference with exactly one symbol definition
2. *Relocation (Verschiebung)*
   - assembles separate code- and data sections into common sections (gemeinsame Abschnitte)
   - moves symbols from their relative position in the object file (.o) to their final storage location in the executable file
   - corrects all references to these symbols, so that all the references point to the new/updated/correct location
     
